Tekla.Structures.Drawing.DrawingLink
The DrawingLink class defines a drawing link object in a drawing.
When a drawing link is double clicked, the target drawing is opened.
The following example shows how to create a basic drawing link to the current drawing.
The drawing mark is used as the link text.
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
public void Example1()
{
DrawingHandler _drawingHandler = new DrawingHandler();
ViewBase _view = _drawingHandler.GetActiveDrawing().GetSheet().GetAllViews().Current as ViewBase;
Size size = new Size(10.0, 10.0);
Point insertionPoint = new Point(200, 200);
DrawingLink link = new DrawingLink(_view, insertionPoint,
_drawingHandler.GetActiveDrawing(), String.Empty, size);
link.Insert();
}
}

Tekla.Structures.Drawing.DrawingLink.Target
Gets or sets the target drawing.

Tekla.Structures.Drawing.DrawingLink.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.Drawing,System.String)
Creates a new drawing link instance using standard attributes.
View: A drawing view.
InsertionPoint: The location for the link.
Target: The link target.
Text: The link text visible to the user.

Tekla.Structures.Drawing.DrawingLink.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.Drawing,System.String,Tekla.Structures.Drawing.LinkAttributes)
Creates a new drawing link instance using the given attributes.
View: A drawing view.
InsertionPoint: The location for the link.
Target: The link target.
Text: The link text visible to the user.
Attributes: The attributes for creating the link.

Tekla.Structures.Drawing.DrawingLink.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.Drawing,System.String,Tekla.Structures.Drawing.Size)
Creates a new drawing link instance of the given size.
View: A drawing view.
InsertionPoint: The location for the link.
Target: The link target.
Text: The link text visible to the user.
Size: The width and height for the link.

Tekla.Structures.Drawing.DrawingLink.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.Drawing,System.String,Tekla.Structures.Drawing.Size,Tekla.Structures.Drawing.LinkAttributes)
Creates a new drawing link instance of the given size.
View: A drawing view.
InsertionPoint: The location for the link.
Target: The link target.
Text: The link text visible to the user.
Size: The width and height for the link.
Attributes: The attributes for creating the link.

Tekla.Structures.Drawing.DrawingLink.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.DrawingLink.Insert
Inserts the link.
Returns: True if succeeded.

Tekla.Structures.Drawing.DrawingLink.Select
Selects the link.
Returns: True if succeeded.

Tekla.Structures.Drawing.DrawingLink.Modify
Modifies the link.
Returns: True if succeeded.

Tekla.Structures.Drawing.DrawingLink.Delete
Deletes the link.
Returns: True if succeeded.